![](./image/pandas-logo.png)

# Python Pandas: Tips & Tricks

Oleh Channel YouTube [Indonesia Belajar](https://www.youtube.com/IndonesiaBelajarKomputer)

## \#01: Menyertakan Prefix dan Suffix pada seluruh Kolom Data Frame

### Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  8  6  4  4  9
1  3  7  4  3  8
2  8  7  2  3  8
3  8  7  9  3  2
4  2  9  6  9  5

In [3]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

### Menyertakan Prefix Kolom

In [4]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        8        6        4        4        9
1        3        7        4        3        8
2        8        7        2        3        8
3        8        7        9        3        2
4        2        9        6        9        5

### Menyertakan Suffix Kolom

In [5]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        8        6        4        4        9
1        3        7        4        3        8
2        8        7        2        3        8
3        8        7        9        3        2
4        2        9        6        9        5

## \#02: Pemilihan baris (rows selection) pada Data Frame

### Import Modules

In [6]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [7]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  2  4  3  2
1  4  4  3  2  1
2  2  4  4  3  4
3  2  2  4  2  4
4  4  4  3  1  1
5  4  3  2  3  1
6  1  3  1  1  1
7  2  1  4  1  1
8  4  1  1  4  3
9  3  3  3  3  1

### Selection dengan operator logika `|`

In [8]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
6  1  3  1  1  1
9  3  3  3  3  1

### Selection dengan fungsi `isin()`

In [9]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
6  1  3  1  1  1
9  3  3  3  3  1

### Mengenal operator negasi `~`

In [10]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  4  2  4  3  2
1  4  4  3  2  1
2  2  4  4  3  4
3  2  2  4  2  4
4  4  4  3  1  1
5  4  3  2  3  1
7  2  1  4  1  1
8  4  1  1  4  3

## \#03: Konversi tipe data String ke Numerik pada kolom Data Frame

### Import Modules

In [11]:
import pandas as pd

print(pd.__version__)

1.0.3

### Persiapan Data Frame

In [12]:
data = {'col1':['1', '2', '3', 'teks'], 
        'col2':['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [13]:
df.dtypes

col1    object
col2    object
dtype: object

### Konversi tipe data dengan fungsi `astype()`

In [14]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [15]:
df_x.dtypes

col1    object
col2     int64
dtype: object

### Konversi tipe data numerik dengan fungsi `to_numeric()`

In [16]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## \#04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

### Import Modules

In [17]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [18]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

/home/boedy/anaconda3/lib/python3.7/site-packages/pandas/util/__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         14.0         14    A
1 2000-01-01 01:00:00         13.0          9    B
2 2000-01-01 02:00:00         11.0         15    C
3 2000-01-01 03:00:00         16.0          9    D
4 2000-01-01 04:00:00          5.0          3    E

In [19]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int64
teks                   object
dtype: object

### Memilih kolom bertipe data numerik

In [20]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         14.0         14
1         13.0          9
2         11.0         15
3         16.0          9
4          5.0          3

In [21]:
df.select_dtypes(include='float')

   bil_pecahan
0         14.0
1         13.0
2         11.0
3         16.0
4          5.0

In [22]:
df.select_dtypes(include='int')

   bil_bulat
0         14
1          9
2         15
3          9
4          3

### Memilih kolom bertipe data string atau `object`

In [23]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

### Memilih kolom bertipe data `datetime`

In [24]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

### Memilih kolom dengan kombinasi tipe data

In [25]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         14.0         14    A
1         13.0          9    B
2         11.0         15    C
3         16.0          9    D
4          5.0          3    E

## \#05: Membalik urutan baris dan kolom pada Data Frame

### Import Modules

In [26]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [27]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  9  4  6  1  3
1  4  8  7  2  7
2  9  4  9  3  4
3  1  3  3  8  7
4  2  7  7  6  3

### Membalik urutan kolom

In [28]:
df.loc[:, ::-1]

   E  D  C  B  A
0  3  1  6  4  9
1  7  2  7  8  4
2  4  3  9  4  9
3  7  8  3  3  1
4  3  6  7  7  2

### Membalik urutan baris

In [29]:
df.loc[::-1]

   A  B  C  D  E
4  2  7  7  6  3
3  1  3  3  8  7
2  9  4  9  3  4
1  4  8  7  2  7
0  9  4  6  1  3

### Membalik urutan baris dan melakukan penyesuaian ulang `index`

In [30]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  2  7  7  6  3
1  1  3  3  8  7
2  9  4  9  3  4
3  4  8  7  2  7
4  9  4  6  1  3

## \#06: Mengganti nama (label) kolom pada Data Frame

### Import Modules

In [31]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [32]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  6  8  5  6
1  8  7  3  1  5
2  5  3  3  7  7
3  1  9  8  8  6
4  8  6  7  7  3

### Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [33]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  4  6     8  5  6
1  8  7     3  1  5
2  5  3     3  7  7
3  1  9     8  8  6
4  8  6     7  7  3

### Mengganti nama (label) untuk banyak kolom pada Data Frame

In [34]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     4       6  8     5  6
1     8       7  3     1  5
2     5       3  3     7  7
3     1       9  8     8  6
4     8       6  7     7  3

## \#07: Menghapus (drop) missing values (`NaN`)

### Import Modules

In [35]:
import pandas as pd

print(pd.__version__)

1.0.3

### Persiapan Data Frame

In [36]:
df = pd.util.testing.makeMissingDataframe().reset_index() 
df.head()

        index         A         B         C         D
0  EpSTpeLVz3       NaN  0.168862  0.750568       NaN
1  TJbAvnHW48 -0.960960  1.510276 -0.033566  0.206877
2  kACSWNi1KH -0.760187 -1.124184 -1.017897 -0.473886
3  vLkEQGKC8S -1.388940 -0.850868       NaN  0.414371
4  W9Kk099TtM -1.020808  0.416674 -1.974267  1.688768

In [37]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  EpSTpeLVz3       NaN  0.168862  0.750568       NaN
1  TJbAvnHW48 -0.960960  1.510276 -0.033566  0.206877
2  kACSWNi1KH -0.760187 -1.124184 -1.017897 -0.473886
3  vLkEQGKC8S -1.388940 -0.850868       NaN  0.414371
4  W9Kk099TtM -1.020808  0.416674 -1.974267  1.688768

In [38]:
df_backup = df.copy(deep=True)

### Menghapus (drop) setiap kolom yang mengandung missing values

In [39]:
df = df.dropna(axis='columns') 
df.head()

            Z
0  EpSTpeLVz3
1  TJbAvnHW48
2  kACSWNi1KH
3  vLkEQGKC8S
4  W9Kk099TtM

### Menghapus (drop) setiap baris yang mengandung missing values

In [40]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
1  TJbAvnHW48 -0.960960  1.510276 -0.033566  0.206877
2  kACSWNi1KH -0.760187 -1.124184 -1.017897 -0.473886
4  W9Kk099TtM -1.020808  0.416674 -1.974267  1.688768
5  QbwECu5cAQ -1.225750 -0.325037 -0.883390 -0.589207
6  WDHBfg0oIK  0.012477  1.711381  0.711575  0.375259

### Persentase missing values untuk tiap kolom

In [41]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.133333
B    0.033333
C    0.200000
D    0.033333
dtype: float64

### Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [42]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         B         D
0  EpSTpeLVz3  0.168862       NaN
1  TJbAvnHW48  1.510276  0.206877
2  kACSWNi1KH -1.124184 -0.473886
3  vLkEQGKC8S -0.850868  0.414371
4  W9Kk099TtM  0.416674  1.688768

## \#08: Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame

### Import Modules

In [43]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [44]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

### Mengenal Pandas Series

In [45]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [46]:
type(df['A'])

pandas.core.series.Series

In [47]:
type(df)

pandas.core.frame.DataFrame

### Memeriksa kesamaan dengan operator `==`

In [48]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

### Memeriksa kesamaan dengan method `equals()`

In [49]:
df['A'].equals(df['B'])

True

### Memeriksa kesamaan antar dua Data Frame

In [50]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [51]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

## \#09: Membagi Data Frame menjadi dua secara acak

### Import Modules

In [52]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [53]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  11  10  12   7  14
1   4   2   8  17  17
2   1   8  15   3   5
3   4  10   7   5   1
4   6  14  12  13  19
5  11  15  10   9   9
6   2  10  15   7  14
7   1   6   4   6   7
8  19   7   6  17  13
9  19  11   7  14  18

### Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [54]:
df.shape

(10, 5)

In [55]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [56]:
df_1

    A   B   C   D   E
4   6  14  12  13  19
0  11  10  12   7  14
6   2  10  15   7  14
8  19   7   6  17  13
2   1   8  15   3   5
1   4   2   8  17  17
9  19  11   7  14  18

In [57]:
df_2

    A   B   C  D  E
3   4  10   7  5  1
5  11  15  10  9  9
7   1   6   4  6  7

## \#10: Mengganti nama (label) kolom pada Data Frame berdasarkan pola

### Import Modules

In [58]:
import pandas as pd

print(pd.__version__)

1.0.3

### Persiapan Data Frame

In [59]:
df = pd.read_csv('./data/titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex  ', '  Age', 
              'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup = df.copy(deep = True)

df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### Menggunakan lowercase untuk nama kolom dan mengganti spasi dengan `_`

In [60]:
df.columns = df.columns.str.replace(' ', '_').str.lower()
df.head()

,pclass,survival_status,full_name,sex__,__age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

### Memangkas kelebihan spasi pada nama kolom

In [61]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

## \#11: Melakukan seleksi sejumlah kolom dan baris pada Data Frame menggunakan `loc`

### Import Modules

In [62]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [63]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  16  14  15   3   6
1   2   2  12   5   9
2   9   4  19  18   3
3   1  18  12   7   7
4  10   3  12  16  19
5   5   7   6  10  18
6   9  17  13   3   7
7  17   9   8   1   1
8   4   7  14  17  18
9   1   2   5   8   3

### Seleksi kolom dan baris menggunakan `loc`

In [64]:
df.loc[[0,3,4], ['B','E']]

    B   E
0  14   6
3  18   7
4   3  19

### Seleksi baris dengan kondisi

In [65]:
df.loc[df['B']>10, ['B','D','E']]

    B  D  E
0  14  3  6
3  18  7  7
6  17  3  7

### Slicing Data Frame dengan `loc`

In [66]:
df.loc[0:4, 'B':'D']

    B   C   D
0  14  15   3
1   2  12   5
2   4  19  18
3  18  12   7
4   3  12  16

## \#12: Membentuk kolom bertipe `datetime` dari sejumlah kolom lain pada Data Frame

### Import Modules

In [67]:
import pandas as pd

print(pd.__version__)

1.0.3

### Persiapan Data Frame

In [68]:
data = {'day':[1, 2, 10 ,25, 12], 
        'month':[1, 2, 4, 5, 6], 
        'year':[2000, 2001, 2010, 2015, 2020]}

df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

### Membentuk kolom bertipe `datetime`

In [69]:
df['penaggalan'] = pd.to_datetime(df[['day', 'month', 'year']])
df

   day  month  year penaggalan
0    1      1  2000 2000-01-01
1    2      2  2001 2001-02-02
2   10      4  2010 2010-04-10
3   25      5  2015 2015-05-25
4   12      6  2020 2020-06-12

In [70]:
df.dtypes

day                    int64
month                  int64
year                   int64
penaggalan    datetime64[ns]
dtype: object

## \#13: Konversi nilai numerik ke dalam sejumlah kategori

### Import Modules

In [71]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [72]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    90
1    84
2    64
3    53
4    52
5    49
6    62
7     4
8    87
9    16

### Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan `cut()`

In [73]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins = [0, 18, 65, 99], 
                             labels = ['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    90        manula
1    84        manula
2    64        dewasa
3    53        dewasa
4    52        dewasa
5    49        dewasa
6    62        dewasa
7     4          anak
8    87        manula
9    16          anak

## \#14: Penggabuangan (merge) dua Data Frame

### Import Modules

In [74]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### Persiapan Data Frame

In [75]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df.head()

    A   B   C   D   E
0   1  10   1   7   9
1   2   9   3  11  18
2   6   8  11   1   4
3   2  18  10  17  10
4  13   1  19   3  17

In [76]:
df1 = df.copy(deep = True)
df1 = df1.drop([1, 2, 4, 7])
df1

    A   B   C   D   E
0   1  10   1   7   9
3   2  18  10  17  10
5   8  12  11  19  13
6  19   1   7   7  10
8   1   4   8   9   8
9  19  11   6  19   6

In [77]:
df2 = df.copy(deep = True)
df2 = df2.drop([5, 8, 9])
df2

    A   B   C   D   E
0   1  10   1   7   9
1   2   9   3  11  18
2   6   8  11   1   4
3   2  18  10  17  10
4  13   1  19   3  17
6  19   1   7   7  10
7  12  12   9  18   6

### Menggabungkan dua Data Frame

In [78]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A   B   C   D   E
0   1  10   1   7   9
1   2  18  10  17  10
2  19   1   7   7  10

In [79]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   1  10   1   7   9
1   2  18  10  17  10
2   8  12  11  19  13
3  19   1   7   7  10
4   1   4   8   9   8
5  19  11   6  19   6
6   2   9   3  11  18
7   6   8  11   1   4
8  13   1  19   3  17
9  12  12   9  18   6

## \#15: Memecah data string dari suatu kolam ke dalam beberapa kolom baru

### Import Modules

In [80]:
import pandas as pd

print(pd.__version__)

1.0.3

### Persiapan Data Frame

In [81]:
data = {'nama':['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'], 
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

### Memecah nama depan dan nama belakang

In [82]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

### Memecah nama kota dan propinsi

In [83]:
df[['kota', 'propinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur